chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
    for (;;) {
        int x, y;

        if (dirty) {
            for (int i = 0; i < 2; i++) {     /* 兩塊都要畫 */
                draw_video_list();
                present();
            }
            dirty = false;
        }
        watchdog_feed();
        if (!sd_present()) {
            return;
        }
        if (!screen_poll()) {
            nap(30);
            continue;
        }
        if (!read_touch(&x, &y)) {
            nap(15);
            continue;
        }
        (void)x;
        if (y >= 720 && y < 782) {
            wait_release();
            return;
        }
        if (y >= VROW_Y0) {
            uint32_t i = (uint32_t)(y - VROW_Y0) / VROW_H;

            if (i < g_vid_count) {
                wait_release();
                play_video(&g_vids[i]);
                dirty = true;
                continue;
            }
        }
        wait_release();
    }
}

/* ------------------------------------------------------------------ */
/* 選擇畫面                                                            */
/* ------------------------------------------------------------------ */

#define ROW_Y0       120
#define ROW_H        58
/* 可見列數從 7 減成 6，騰出的 58px 給「方向」那一列。資料夾清單本來就
 * 可以上下滑，少一列的代價比擠不下設定小。 */
#define ROWS_VISIBLE 6
#define BTN_ALL_Y    516
#define BTN_ALL_H    48
#define OR_Y         584
#define OR_H         48
#define OR_X0        110
#define OR_W         100
#define OR_GAP       10
#define IV_Y         652
#define IV_H         48
#define IV_X0        110
#define IV_W         74
#define IV_GAP       10
#define BTN_GO_Y     720
#define BTN_GO_H     62
/* 有影片時底下那列拆成「開始播放」＋「影片」兩顆。 */
#define BTN_GO_W     280
#define BTN_VID_X    304
#define BTN_VID_W    160

static const char *const ORIENT_NAME[PHOTO_ORIENT_COUNT] = {
    "直立", "橫向", "自動"
};

static uint32_t g_scroll;

static void draw_checkbox(int x, int y, bool on)
{
    gfx_rect(x, y, 32, 32, on ? COL_ACCENT : COL_LINE);
    gfx_rect(x + 1, y + 1, 30, 30, on ? COL_ACCENT : COL_LINE);
    if (on) {
        gfx_fill_rect(x + 8, y + 8, 16, 16, COL_ACCENT);
    }
}

/* 名稱太長就從尾端截掉，避免壓到右邊的張數。 */
static void draw_name_clipped(int x, int y, const char *s, int limit,
                              uint16_t color)
{
    char buf[NAME_MAX];

    strncpy(buf, s, NAME_MAX - 1U);
    buf[NAME_MAX - 1U] = 0;

    while (gfx_text_width(buf) > limit) {
        size_t len = strlen(buf);
        if (len == 0U) {
            break;
        }
        /* 往前退到不是 UTF-8 接續位元組的位置，才不會砍出半個字。 */
        do {
            len--;
        } while (len > 0U && ((buf[len] & 0xC0) == 0x80));
        buf[len] = 0;
    }
    gfx_text(x, y, buf, color);
}

static void draw_select_screen(void)
{
    uint32_t shown;

    /* 選單、掃描進度、錯誤訊息都是照直立版面寫死的座標。播放中可能切到
     * 橫向，回到這些畫面之前一定要扳回來，否則版面整個跑掉。 */
    gfx_set_orientation(false);
    gfx_clear(COL_BG);
    gfx_text_center(GFX_W / 2, 24, "電子相簿", COL_TEXT);
    gfx_text_center(GFX_W / 2, 62, "選擇要播放的資料夾", COL_DIM);

    shown = g_top_count - g_scroll;
    if (shown > ROWS_VISIBLE) {
        shown = ROWS_VISIBLE;
    }

    for (uint32_t i = 0; i < shown; i++) {
        uint32_t idx = g_scroll + i;
        int y = ROW_Y0 + (int)i * ROW_H;

        gfx_fill_rect(16, y, GFX_W - 32, ROW_H - 8, COL_PANEL);
        draw_checkbox(28, y + 9, g_top[idx].selected);
        draw_name_clipped(76, y + 15, g_top[idx].name,
                          GFX_W - 76 - 96, COL_TEXT);
        gfx_number_right(GFX_W - 28, y + 15, g_top[idx].photos, COL_DIM);
    }

    if (g_top_count > ROWS_VISIBLE) {
        gfx_text_center(GFX_W / 2, ROW_Y0 + ROWS_VISIBLE * ROW_H + 6,
                        "上下滑動看更多", COL_DIM);
    }

    gfx_pill(16, BTN_ALL_Y, GFX_W - 32, BTN_ALL_H, COL_PANEL);
    gfx_text_center(GFX_W / 2, BTN_ALL_Y + 14, "全部選取或取消", COL_TEXT);

    gfx_text(20, OR_Y + 14, "方向", COL_DIM);
    for (uint32_t o = 0; o < PHOTO_ORIENT_COUNT; o++) {
        int  x  = OR_X0 + (int)o * (OR_W + OR_GAP);
        bool on = ((uint32_t)photo_get_orientation() == o);
        gfx_pill(x, OR_Y, OR_W, OR_H, on ? COL_ACCENT : COL_PANEL);
        gfx_text_center(x + OR_W / 2, OR_Y + 14, ORIENT_NAME[o],
                        on ? COL_BG : COL_TEXT);
    }

    gfx_text(20, IV_Y + 14, "間隔", COL_DIM);
    for (uint32_t s = 2; s <= 5; s++) {
        int  x  = IV_X0 + (int)(s - 2) * (IV_W + IV_GAP);
        bool on = (g_interval_s == s);
        gfx_pill(x, IV_Y, IV_W, IV_H, on ? COL_ACCENT : COL_PANEL);
        gfx_number(x + 20, IV_Y + 14, s, on ? COL_BG : COL_TEXT);
        gfx_text(x + 40, IV_Y + 14, "秒", on ? COL_BG : COL_TEXT);
    }

    {
        uint32_t n  = selected_photo_count();
        /* 卡上有影格包時，底下那一列拆成兩顆按鈕。沒有影片就維持原樣佔滿
         * 整列 —— 大部分使用者不會放影片，不該為此犧牲照片按鈕的寬度。 */
        int      gw = g_vid_count ? BTN_GO_W : (GFX_W - 32);

        gfx_pill(16, BTN_GO_Y, gw, BTN_GO_H, n ? COL_ACCENT : COL_PANEL);
        if (n) {
            gfx_text_center(16 + gw / 2, BTN_GO_Y + 12, "開始播放", COL_BG);
            if (!g_vid_count) {
                gfx_number_right(GFX_W - 40, BTN_GO_Y + 12, n, COL_BG);
            }
        } else {
            gfx_text_center(16 + gw / 2, BTN_GO_Y + 20,
                            g_vid_count ? "無照片" : "沒有選取任何資料夾",
                            COL_DIM);
        }

        if (g_vid_count) {
            gfx_pill(BTN_VID_X, BTN_GO_Y, BTN_VID_W, BTN_GO_H, COL_PANEL);
            gfx_text_center(BTN_VID_X + BTN_VID_W / 2, BTN_GO_Y + 12,
                            "影片", COL_ACCENT);
        }
    }
}

/* 兩塊 buffer 都要畫，否則交換之後會看到上一次的內容。 */
static void repaint_select(void)
{
    for (int i = 0; i < 2; i++) {
        draw_select_screen();
        present();
    }
}

/* 回傳 true 表示要開始播放。 */
static bool select_screen(void)
{
    bool dirty = true;

    for (;;) {
        int x, y;

        if (dirty) {
            repaint_select();
            dirty = false;
        }

        watchdog_feed();
        if (!sd_present()) {
            return false;               /* 卡片被拔掉，交回上層處理 */
        }
        if (!screen_poll()) {
            /* 螢幕關著時不吃觸控，否則會在看不見的情況下改到設定。 */
            nap(30);
            continue;
        }

