chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
        if (!read_touch(&x, &y)) {
            nap(15);
            continue;
        }

        if (y >= ROW_Y0 && y < ROW_Y0 + ROWS_VISIBLE * ROW_H) {
            uint32_t i = g_scroll + (uint32_t)(y - ROW_Y0) / ROW_H;
            if (i < g_top_count) {
                g_top[i].selected = !g_top[i].selected;
                dirty = true;
            }
        } else if (y >= BTN_ALL_Y && y < BTN_ALL_Y + BTN_ALL_H) {
            bool any = false;
            for (uint32_t i = 0; i < g_top_count; i++) {
                if (g_top[i].selected) {
                    any = true;
                }
            }
            for (uint32_t i = 0; i < g_top_count; i++) {
                g_top[i].selected = !any;
            }
            dirty = true;
        } else if (y >= OR_Y && y < OR_Y + OR_H) {
            for (uint32_t o = 0; o < PHOTO_ORIENT_COUNT; o++) {
                int bx = OR_X0 + (int)o * (OR_W + OR_GAP);
                if (x >= bx && x < bx + OR_W) {
                    photo_set_orientation((photo_orient_t)o);
                    dirty = true;
                }
            }
        } else if (y >= IV_Y && y < IV_Y + IV_H) {
            for (uint32_t s = 2; s <= 5; s++) {
                int bx = IV_X0 + (int)(s - 2) * (IV_W + IV_GAP);
                if (x >= bx && x < bx + IV_W) {
                    g_interval_s = s;
                    dirty = true;
                }
            }
        } else if (y >= BTN_GO_Y && y < BTN_GO_Y + BTN_GO_H) {
            if (g_vid_count && x >= BTN_VID_X && x < BTN_VID_X + BTN_VID_W) {
                wait_release();
                video_list_screen();
                dirty = true;
                continue;
            }
            if ((!g_vid_count || x < BTN_GO_W + 16) &&
                selected_photo_count() > 0U) {
                build_order();
                wait_release();
                return true;
            }
        }

        wait_release();
    }
}

/* ------------------------------------------------------------------ */
/* 播放                                                                */
/* ------------------------------------------------------------------ */

/* 掃描進度。數字會一直跳，讓使用者知道它在動而不是當掉了。 */
static void show_scan_progress(void)
{
    watchdog_feed();
    gfx_set_orientation(false);
    for (int i = 0; i < 2; i++) {
        gfx_clear(COL_BG);
        gfx_text_center(GFX_W / 2, GFX_H / 2 - 60, "掃描記憶卡", COL_TEXT);
        gfx_number_right(GFX_W / 2 + 20, GFX_H / 2, g_photo_count, COL_ACCENT);
        gfx_text(GFX_W / 2 + 28, GFX_H / 2, "張", COL_DIM);
        present();
    }
}

static void show_message(const char *line1, const char *line2)
{
    gfx_set_orientation(false);
    for (int i = 0; i < 2; i++) {
        gfx_clear(COL_BG);
        gfx_text_center(GFX_W / 2, GFX_H / 2 - 40, line1, COL_TEXT);
        if (line2) {
            gfx_text_center(GFX_W / 2, GFX_H / 2 + 10, line2, COL_DIM);
        }
        present();
    }
}

/* 螢幕關著時停在這裡。回傳 false 代表卡片被拔掉。 */
static bool wait_screen_on(void)
{
    while (!screen_poll()) {
        watchdog_feed();
        if (!sd_present()) {
            return false;
        }
        nap(100);
    }
    return true;
}

/* 判斷觸控是短按還是長按。回傳 0=沒碰到，1=短按，2=長按。
 *
 * 短按暫停／繼續、長按回選單。原本短按就直接離開，結果想停下來看某一張時
 * 只能被踢回選單，反而看不到。 */


/* 暫停 / 繼續的視覺回饋。
 *
 * 按鍵操作沒有觸覺以外的回饋，使用者按下去看畫面沒變會不確定有沒有成功。
 * 在畫面中央閃一個圖示一秒再還原 —— 蓋住的區域先備份，還原後照片完整。 */
#define ICON_SZ     140
#define ICON_SAVE   ((uint16_t *)0x91F00000u)   /* 140x140x2 = 39KB */

/* 圖示置中的位置。畫布尺寸隨方向改變，所以不能是常數。 */
static int icon_x(void) { return (gfx_width()  - ICON_SZ) / 2; }
static int icon_y(void) { return (gfx_height() - ICON_SZ) / 2; }

static void icon_backup(bool restore)
{
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    int       ix = icon_x(), iy = icon_y();

    /* 兩種方向下「哪個軸在實體記憶體裡連續」剛好相反：
     *   直立：邏輯 x 是實體列，所以沿著邏輯 y 走才連續
     *   橫向：畫布與面板同向，沿著邏輯 x 走就連續
     * 兩者都是每次搬 ICON_SZ 個連續像素，只差基底怎麼算。 */
    for (uint32_t i = 0; i < ICON_SZ; i++) {
        uint16_t *fb;
        uint16_t *sv = ICON_SAVE + i * ICON_SZ;

        if (gfx_is_landscape()) {
            fb = front + (uint32_t)(iy + (int)i) * PHYS_W + (uint32_t)ix;
        } else {
            fb = front + (uint32_t)(gfx_width() - 1 - (ix + (int)i)) * PHYS_W
                       + (uint32_t)iy;
        }
        if (restore) {
            memcpy(fb, sv, ICON_SZ * sizeof(uint16_t));
        } else {
            memcpy(sv, fb, ICON_SZ * sizeof(uint16_t));
        }
    }
}

static void flash_icon(bool paused)
{
    uint16_t *back  = gfx_framebuffer();
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    int cx = gfx_width()  / 2;
    int cy = gfx_height() / 2;
    int ICON_X = icon_x(), ICON_Y = icon_y();

    icon_backup(false);
    gfx_set_framebuffer(front);

    /* 半透明底：把區域壓暗，圖示才浮得出來。 */
    for (int j = 0; j < ICON_SZ; j++) {
        for (int i = 0; i < ICON_SZ; i++) {
            uint16_t v = gfx_get_pixel(ICON_X + i, ICON_Y + j);
            gfx_pixel(ICON_X + i, ICON_Y + j,
                      (uint16_t)((((v >> 11) & 0x1Fu) >> 1) << 11 |
                                 (((v >> 5) & 0x3Fu) >> 1) << 5 |
                                 ((v & 0x1Fu) >> 1)));
        }
    }

    if (paused) {
        gfx_fill_rect(cx - 30, cy - 36, 20, 72, COL_TEXT);   /* ▮▮ */
        gfx_fill_rect(cx + 10, cy - 36, 20, 72, COL_TEXT);
    } else {
        /* ▶：逐列畫，寬度隨高度線性收斂 */
        for (int j = 0; j < 72; j++) {
            int half = (j < 36) ? j : (71 - j);
            gfx_fill_rect(cx - 24, cy - 36 + j, 12 + half, 1, COL_TEXT);
        }
    }

    gfx_set_framebuffer(back);
    nap(1000);
    icon_backup(true);
}

/* 切換方向時閃一下目前的模式。
 *
 * 三段循環沒有回饋的話使用者不知道自己切到哪了 —— 沿用暫停圖示那套
 * 「壓暗背景、蓋上內容、一秒後還原」的機制。 */
static void flash_orient(void)
{
    uint16_t *back  = gfx_framebuffer();
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    int cx = gfx_width() / 2;
    int cy = gfx_height() / 2;
    int ix = icon_x(), iy = icon_y();

    icon_backup(false);
    gfx_set_framebuffer(front);

    for (int j = 0; j < ICON_SZ; j++) {
        for (int i = 0; i < ICON_SZ; i++) {
            uint16_t v = gfx_get_pixel(ix + i, iy + j);
            gfx_pixel(ix + i, iy + j,
                      (uint16_t)((((v >> 11) & 0x1Fu) >> 1) << 11 |
                                 (((v >> 5) & 0x3Fu) >> 1) << 5 |
                                 ((v & 0x1Fu) >> 1)));
        }
    }
    gfx_text_center(cx, cy - 10, ORIENT_NAME[photo_get_orientation()],
                    COL_TEXT);

    gfx_set_framebuffer(back);
    nap(1000);
    icon_backup(true);
}

/* 暫停中的滑動判定。
 * 邏輯座標：x 是橫向（0~479），y 是縱向（0~799，往下遞增）。
 * 縱向門檻設得比橫向大，因為畫面高是寬的 1.67 倍，手滑起來也比較長。 */
#define SWIPE_MIN_X  60
#define SWIPE_MIN_Y  120
#define SWIPE_GAP_MS 150u   /* 容忍觸控中途漏報多久 */

/* 暫停：畫面停在目前這張。按鍵控制暫停/選單，滑動翻頁。 */
#define PAUSE_RESUME 0
#define PAUSE_MENU   1
#define PAUSE_PREV   2
#define PAUSE_NEXT   3
#define PAUSE_ROTATE 4

static int paused_loop(void)
{
    g_paused    = 1u;
    g_req_pause = 0u;               /* 消化掉進來的那一次 */
    flash_icon(true);

