chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
    for (;;) {
        int x0, y0;

        watchdog_feed();
        if (!sd_present()) {
            g_req_pause = 0u;
            g_paused    = 0u;
            return PAUSE_MENU;
        }
        if (g_req_pause) {
            g_req_pause = 0u;
            g_paused    = 0u;
            flash_icon(false);
            return PAUSE_RESUME;
        }

        /* 暫停中用滑動操作。
         *
         * 這塊板子只有一顆 USER 鍵，三段手勢已經吃掉亮度/暫停/選單，再塞
         * 翻頁只會變成沒人記得住的組合技。滑動是相簿的通用手勢，判定區是
         * 整個螢幕 —— 比先前那排小按鈕好按得多。
         *
         *   往左滑  下一張      往右滑  上一張      往下滑  回選單
         *
         * 取「位移較大的那個軸」判斷方向，避免斜著滑時兩種動作互搶。 */
        if (read_touch(&x0, &y0)) {
            int      x, y, dx = 0, dy = 0;
            uint32_t t0   = HAL_GetTick();
            uint32_t seen = t0;

            g_dbg_touch_hit++;

            /* 取「整段過程中的最大位移」，而不是放開瞬間的位置。
             *
             * 而且要容忍中途漏報：觸控控制器在手指快速移動時會掉幾筆，
             * 一讀不到就結束的話，位移只算到中斷點為止 —— 橫向滑動通常
             * 比較快，所以特別容易被截斷（實測往下滑慢而長就沒事）。 */
            for (;;) {
                uint32_t now = HAL_GetTick();

                watchdog_feed();
                if (read_touch(&x, &y)) {
                    int cx = x - x0;
                    int cy = y - y0;

                    seen = now;
                    if (((cx < 0) ? -cx : cx) > ((dx < 0) ? -dx : dx)) {
                        dx = cx;
                    }
                    if (((cy < 0) ? -cy : cy) > ((dy < 0) ? -dy : dy)) {
                        dy = cy;
                    }
                } else if (now - seen > SWIPE_GAP_MS) {
                    break;              /* 真的放開了 */
                }
                if (now - t0 > 2000u) {
                    break;              /* 按著不放就不算滑動 */
                }
                nap(10);
            }

            g_dbg_swipe_dx = dx;
            g_dbg_swipe_dy = dy;

            /* 取位移較大的那個軸，避免斜著滑時兩種動作互搶。 */
            {
                int ax = (dx < 0) ? -dx : dx;
                int ay = (dy < 0) ? -dy : dy;

                if (ay >= SWIPE_MIN_Y && ay > ax && dy > 0) {
                    g_paused = 0u;
                    return PAUSE_MENU;      /* 往下滑：回選單 */
                }
                if (ay >= SWIPE_MIN_Y && ay > ax && dy < 0) {
                    /* 往上滑：方向循環（直立 -> 橫向 -> 自動）。
                     * 按鍵已經被短按/長按佔滿，再加第三種時間長度手指
                     * 拿捏不出來（board-notes 14.4），所以走手勢。 */
                    return PAUSE_ROTATE;
                }
                if (ax >= SWIPE_MIN_X && ax > ay) {
                    g_paused = 0u;
                    return (dx < 0) ? PAUSE_NEXT : PAUSE_PREV;
                }
            }
        }
        nap(30);
    }
}


/* 等目前這張照片的展示時間走完。
 *
 * already_ms 是「這張已經在螢幕上待了多久」—— 也就是解下一張花掉的時間。
 * 解碼期間前一張本來就在螢幕上，那段時間當然要算進展示時間裡，否則使用者
 * 設 2 秒會變成「解碼 1.5 秒 + 等 2 秒 = 3.5 秒」，設定值和實際對不上。
 *
 * 回傳 0 = 正常等完，1 = 要離開播放，2 = 卡片被拔掉，
 *     3 = 暫停中按了上一張，4 = 下一張。 */
static int wait_interval(uint32_t already_ms)
{
    uint32_t wait_ms = g_interval_s * 1000u;
    uint32_t waited  = (already_ms > wait_ms) ? wait_ms : already_ms;
    uint32_t last    = HAL_GetTick();

    while (waited < wait_ms) {
        uint32_t now;

        watchdog_feed();
        if (!sd_present()) {
            return 2;
        }
        if (!screen_poll()) {
            /* 亮度 0（螢幕關著）：不累計時間，再點亮時這張還有完整時間。 */
            nap(100);
            last = HAL_GetTick();
            continue;
        }

        now = HAL_GetTick();
        waited += now - last;
        last = now;

        if (g_req_pause) {
            return 3;               /* 交給 slideshow 統一處理暫停 */
        }
        nap(15);
    }
    return 0;
}

/* 暫停期間的互動，含翻頁。
 *
 * 翻頁之後要「留在暫停」，所以這裡是個迴圈：paused_loop() 回報翻頁就解碼
 * 並顯示，然後再進 paused_loop() 等下一個指令，直到使用者要繼續或回選單。
 *
 * 先前這段邏輯散在 wait_interval 和 slideshow 兩處，而 wait_interval 只判斷
 * 「是不是回選單」，翻頁的回傳值被當成沒事發生 —— 症狀就是滑動翻了頁卻
 * 立刻自動繼續播放。集中在一個地方就不會再漏。
 *
 * *cur 進來是目前顯示的索引，出去是最後顯示的那張。
 * 回傳 0 = 繼續播放，1 = 回選單。 */
static int pause_session(int32_t *cur)
{
    for (;;) {
        int a = paused_loop();
        int dir;
        uint32_t target, tries;
        photo_result_t r;

        if (a == PAUSE_MENU) {
            return 1;
        }
        if (a == PAUSE_RESUME) {
            return 0;
        }
        if (a == PAUSE_ROTATE) {
            photo_set_orientation((photo_orient_t)
                (((uint32_t)photo_get_orientation() + 1u) % PHOTO_ORIENT_COUNT));
            /* 重畫目前這張，讓使用者當場看到新方向的結果。 */
            if (*cur >= 0 &&
                photo_show(PLAYLIST_BASE + g_order[*cur] * PATH_MAX)
                    == PHOTO_OK) {
                present();
            }
            flash_orient();
            continue;
        }

        /* 翻頁：往指定方向找一張解得開的，最多繞一圈。 */
        dir    = (a == PAUSE_PREV) ? -1 : 1;
        target = (uint32_t)((*cur < 0) ? 0 : *cur);
        tries  = 0;
        r      = PHOTO_ERR_READ;

        while (tries < g_order_count) {
            watchdog_feed();
            target = (target + g_order_count + (uint32_t)dir) % g_order_count;
            r = photo_show(PLAYLIST_BASE + g_order[target] * PATH_MAX);
            tries++;
            if (r == PHOTO_OK || r == PHOTO_ABORTED) {
                break;
            }
            g_decode_fail++;
        }
        if (r == PHOTO_OK) {
            present();
            *cur = (int32_t)target;
            g_decode_ok++;
        }
    }
}

/* 播放。
 *
 * 解碼與顯示重疊：目前這張在螢幕上的時候，就先把下一張解進另一塊 buffer，
 * 時間到直接切換。這樣換頁是瞬間的，而且間隔設定值就是實際的展示時間 ——
 * 只要解碼比間隔快。解碼比間隔慢的話，展示時間就等於解碼時間，沒辦法更快。 */
static void slideshow(void)
{
    uint32_t pos = 0;           /* 下一張要解碼的 g_order 索引 */
    int32_t  cur = -1;          /* 顯示中的索引，-1 = 還沒顯示過 */

    wait_release();

    for (;;) {
        photo_result_t r;
        uint32_t t0;

        watchdog_feed();
        if (!sd_present() || !wait_screen_on()) {
            return;
        }

        /* 解下一張：畫進 back buffer，此時前一張還在螢幕上。 */
        t0 = HAL_GetTick();
        r = photo_show(PLAYLIST_BASE + g_order[pos] * PATH_MAX);
        if (r != PHOTO_OK && r != PHOTO_ABORTED) {
            r = photo_show(PLAYLIST_BASE + g_order[pos] * PATH_MAX);
        }
        g_last_ms = HAL_GetTick() - t0;

        if (r == PHOTO_ABORTED) {
            /* 解碼途中按了暫停：這張不要了，停在螢幕上那張。
             * 半畫好的 back buffer 沒有 present，看不到。 */
            if (pause_session(&cur)) {
                return;
            }
            pos = (uint32_t)((cur < 0) ? 0 : (cur + 1)) % g_order_count;
            continue;
        }

